const
vector<string> cvs_type1 = {
  "あまり", "そんなに", "ぜったい", "まったく", "すこしも", "いまひと", "いまひとつも", "ちょっとも", "ちっとも", "いまいち", "まさか", "そんな", "ぜんぜん", "そもそも", "すら", "とても", "余り", "絶対", "ゼッタイ", "全く", "マッタク", "少しも", "今ひとつ", "今一つ", "今一", "今いち", "全然"
};

const
vector<string> cvs_type2 = {
  "あまりない", "そんなにない", "ぜったいない", "まったくない", "すこしもない", "いまひとつない", "いまひとつもない", "ちょっともない", "ちっともない", "いまいちない", "ぜんぜんない", "そもそもない", "といえない", "とはいえない", "と思わない", "とは思わない", "と思えない", "とは思えない", "とすら思えない", "てはいけない", "ちゃいけない", "じゃいけない", "てはだめ", "ちゃだめ", "じゃだめ", "てはいかん", "てはあかん", "ちゃいかん", "じゃいかん", "じゃあかん", "じゃない", "ちゃあかん", "なくていい", "なくてOK", "なくてＯＫ", "なくて大丈夫", "なくて問題ない", "なくて結構", "なくてもいい", "なくてもOK", "なくても大丈夫", "なくても問題ない", "なくても結構", "く思わない", "く思えない", "もんか", "ものか", "わけではない", "わけじゃない", "こともない", "ことはない", "わけない", "わけがない", "わけはない", "わけもない", "わけか", "わけにはいかない", "わけにはいくまい", "わけにもいかない", "余りない", "ゼッタイない", "絶対ない", "全くない", "少しもない", "今一つない", "今ひとつない", "今一つもない", "今ひとつもない", "今いちない", "今一ない", "全然ない", "と言えない", "とは言えない", "ては行けない", "ちゃ行けない", "じゃ行けない", "ては行かん", "ちゃ行かん", "じゃ行かん", "じゃあかん", "ちゃあかん", "なくて良い", "なくてOK", "なくてＯＫ", "なくても良い", "訳ではない", "でわない", "ではない", "でゎない", "訳じゃない", "訳ない", "訳がない", "訳はない", "訳もない", "訳か", "訳にはいかない", "訳には行かない", "訳にはいくまい", "訳にも行かない"};
